{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "fifteen-sailing",
   "metadata": {},
   "source": [
    "# Набор заданий №3\n",
    "\n",
    "### Задание 1\n",
    "В Тридевятом Царстве уже много лет как установилась конституционная монархия. В парламент Тридевятого царства входят 26 партий, обозначаемых строчными буквами английского алфавита от «a» до «z». Заседание парламента в соответствии с регламентом проходит по следующей схеме:\n",
    "- В начале заседания никаких законопроектов на повестке дня не стоит.\n",
    "- Любая партия (в том числе и та, которая внесла текущий законопроект) в любой момент времени может внести на обсуждение новый законопроект.\n",
    "- При вносе партией нового законопроекта обсуждение предыдущего приостанавливается и начинается обсуждение нового. После того, как парламентарии голосуют за новый законопроект, обсуждение законопроекта, прерванного им, продолжается.\n",
    "- Дискуссия по любому законопроекту обязана завершиться голосованием по этому законопроекту.\n",
    "- В конце заседания не должно остаться внесённых законопроектов, дискуссия по которым не завершена.\n",
    "\n",
    "Вам дана запись о событиях на сессии парламента. Каждое событие является либо внесением нового законопроекта, либо голосованием за какой-то законопроект, причём в обоих случаях известен номер партии, этот законопроект предложившей. События даны в том порядке, в котором они происходили. Проверьте, может ли данная запись о событиях соответствовать какому-либо заседанию, удовлетворяющему порядку проведения, описанному выше.\n",
    "#### Ввод\n",
    "Первая строка входных данных содержит одно целое число *K* – количество строк в записи сессии (1 ≤ *K* ≤ 1000). Каждая строка соответствует одному из двух событий:\n",
    "\n",
    "- Add *x* – партия x внесла на голосование законопроект.\n",
    "- Vote *x* – прошло голосование за документ, внесённый партией *x*.\n",
    "\n",
    "Здесь *x* – строчная буква английского алфавита от «a» до «z», задающая партию.\n",
    "#### Вывод\n",
    "Выведите «Yes», если существует корректный порядок проведения заседания, который мог привести к такой записи, и «No», если ни при каком корректном порядке проведения заседания данная запись появиться не могла."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "concerned-lewis",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "введите К 4\n",
      "Add a\n",
      "Add b\n",
      "Vote b\n",
      "Vote a\n",
      "Yes\n"
     ]
    }
   ],
   "source": [
    "def task1():\n",
    "    stack = []\n",
    "    k = int(input('введите К '))\n",
    "    if k%2>0:\n",
    "        return \"No\"\n",
    "    \n",
    "    for i in range(k):\n",
    "        cmd, name = input().split()\n",
    "        \n",
    "        if cmd == \"Add\":\n",
    "            stack.append(name)\n",
    "        else:\n",
    "            if len(stack) == 0 or stack[-1] != name:\n",
    "                return \"No\"\n",
    "            stack.pop()\n",
    "        \n",
    "        if k/2<len(stack):\n",
    "            return(\"No\")\n",
    "            \n",
    "    return \"Yes\" if len(stack) == 0 else \"No\"\n",
    "print(task1())"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "controversial-location",
   "metadata": {},
   "source": [
    "### Задача 2. Правильный подмногоугольник\n",
    "\n",
    "Задан правильный *N*-угольник. Требуется выбрать наименьшее количество его вершин, которые также образуют правильный многоугольник.\n",
    "\n",
    "#### Входные данные\n",
    "\n",
    "Входные данные содержат одно целое число *N* (3 ≤ *N* ≤ 1012).\n",
    "\n",
    "#### Вывод\n",
    "\n",
    "Выведите одно число — наименьшее количество вершин заданного многоугольника, которые образуют правильный многоугольник."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "coated-highway",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3\n",
      "4\n",
      "3\n",
      "7\n",
      "23\n"
     ]
    }
   ],
   "source": [
    "def subPolygon(N):\n",
    "    maxDivider = 1\n",
    "    for i in range(N - 1,1,-1):\n",
    "        counter = 0\n",
    "        if N % i == 0:\n",
    "            for j in range(i - 1, 1, -1):\n",
    "                if (i % j == 0):\n",
    "                    counter = counter + 1\n",
    "            if ((counter == 0) and (maxDivider < i) and (N // i > 2)):\n",
    "                maxDivider = i\n",
    "    print(N // maxDivider)\n",
    "    \n",
    "subPolygon(3)\n",
    "subPolygon(4)\n",
    "subPolygon(6)\n",
    "subPolygon(7)\n",
    "subPolygon(23)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cordless-fundamentals",
   "metadata": {},
   "source": [
    "### Задача 3.\n",
    "\n",
    "На форуме, на котором обсуждаются задачи олимпиад по информатике, ввели следующий аналог капчи. Участнику выдаётся строка из *N* десятичных цифр (без ведущих нулей). В качестве ответа требуется ввести такое основание системы счисления *B*, что в этой системе счисления выданная запись будет соответствовать составному числу (назовем его *D*), а также число *X*, большее 1 и меньшее *D*, являющееся делителем *D*.\n",
    "\n",
    "При этом *B* и *X* не должны превосходить 10^9.\n",
    "\n",
    "По заданной строке десятичных цифр найдите любую пару чисел *B* и *X*, удовлетворяющую ограничениям, или ответьте, что решения в заданных ограничениях не существует.\n",
    "\n",
    "#### Входные данные\n",
    "\n",
    "Входные данные состоят из непустой строки длиной до 3 ⋅ 106 символов, составленной из цифр от 0 до 9 и не начинающейся с 0.\n",
    "\n",
    "#### Вывод\n",
    "\n",
    "Если решение существует, выведите два числа – основание системы счисления *B* и делитель *X*, записанные в десятичной системе счисления. Оба числа должны удовлетворять ограничениям 2 ≤ *B*, *X* ≤ 10^9. Если решения не существует, выведите –1."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "jewish-rocket",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите строку 16\n",
      "8 2\n"
     ]
    }
   ],
   "source": [
    "from sympy import *\n",
    "\n",
    "def to_10 (a: str, b: int) -> int:\n",
    "    ans = 0\n",
    "    for i in range (0, len(a)):\n",
    "        ans += int(a[i])*pow(b, len(a)-i-1)\n",
    "    return ans\n",
    "\n",
    "\n",
    "n = input('Введите строку ')\n",
    "fl = True\n",
    "max_num = -1\n",
    "for i in range (len(n)):\n",
    "    if int(n[i]) > max_num:\n",
    "        max_num = int(n[i])\n",
    "for b in range (max_num+1, 1000000000):\n",
    "    if b % 1000000 == 0:\n",
    "        print (b)\n",
    "    if not fl:\n",
    "        break\n",
    "    n_10 = to_10(n, b)\n",
    "    if not isprime(n_10):\n",
    "        for i in range (2, n_10-1):\n",
    "            if n_10 % i == 0:\n",
    "                print (b, i)\n",
    "                fl = False\n",
    "                break\n",
    "if fl:\n",
    "    print (-1)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
